# web - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.data.vercel_project_directory.default: Reading...
module.common_resources.data.vercel_project_directory.default: Read complete after 0s [id=../../../]
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Reading...
module.common_resources.data.aws_ssm_parameter.user_pool_id: Reading...
module.common_resources.data.aws_ssm_parameter.gateway_api_endpoint: Read complete after 0s [id=staging_gateway_api_endpoint]
module.common_resources.data.aws_ssm_parameter.user_pool_id: Read complete after 0s [id=staging_user-pool-id]
module.common_resources.vercel_project.default: Refreshing state... [id=prj_PyBTAvZ9aVdAkQ4a9dkWI3wSHHWX]
module.common_resources.vercel_project_domain.default: Refreshing state... [id=new-staging.connectilly.com]
module.common_resources.vercel_deployment.default: Refreshing state... [id=dpl_FmeKtTH82yFk7GQ5nfNdHw7WAgKt]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.common_resources.aws_cognito_user_pool_client.default will be created
  + resource "aws_cognito_user_pool_client" "default" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client          = true
      + allowed_oauth_scopes                          = [
          + "email",
          + "openid",
          + "profile",
        ]
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = [
          + "http://localhost:3000/api/auth/callback/cognito",
          + "https://new-staging.connectilly.com/api/auth/callback/cognito",
        ]
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = true
      + explicit_auth_flows                           = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_SRP_AUTH",
        ]
      + generate_secret                               = true
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "staging_web"
      + prevent_user_existence_errors                 = "ENABLED"
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = (known after apply)
      + supported_identity_providers                  = [
          + "COGNITO",
        ]
      + user_pool_id                                  = (sensitive value)
      + write_attributes                              = (known after apply)
    }

  # module.common_resources.vercel_deployment.default must be replaced
-/+ resource "vercel_deployment" "default" {
      ~ domains     = [ # forces replacement
          - "new-staging.connectilly.com",
          - "staging-web-pink.vercel.app",
          - "staging-web-connectilly.vercel.app",
          - "staging-web-mortezaalizadeh-connectilly.vercel.app",
        ] -> (known after apply) # forces replacement
      ~ files       = { # forces replacement
          ~ "../../../infrastructure/workspaces/common/outputs.tf"             = "137~120b38333e73fdc7b2fcd392bf0e86abfb55ff31" -> "217~d359eda6f62d0b7c19e390cacae394a151a04dcf"
          ~ "../../../infrastructure/workspaces/common_resources/resources.tf" = "1123~bec557d86037ba7d9bc1400f523a59e075116b2a" -> "2661~9787174a80ee0feb660f3077bc4ceb0db0323ddc"
            # (30 unchanged elements hidden)
        }
      ~ id          = "dpl_FmeKtTH82yFk7GQ5nfNdHw7WAgKt" -> (known after apply)
      ~ url         = "staging-a71fkhuim-connectilly.vercel.app" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.common_resources.vercel_project.default will be updated in-place
  ~ resource "vercel_project" "default" {
      ~ environment                = (sensitive value)
        id                         = "prj_PyBTAvZ9aVdAkQ4a9dkWI3wSHHWX"
        name                       = "staging-web"
      ~ serverless_function_region = "iad1" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*